# Import Packages
Below, you'll find what you need in order to run this notebook successfully. I used Pandas and Matplotlib.

In [4]:
import matplotlib.pyplot as plt
import pandas as pd

# Read Data In
I pulled in baby name data from 2010 and 2019; the show premiered in April 2011, so I chose the year before as a comparison to demonstrate that some of the names might not have ever been
on anyone's radar, save people that had read the books. I chose 2019 because the series ended in May of that year, so by then, the names would have become a part of pop culture.

In [30]:
#2010 data
df_2010 = pd.read_csv('assets/yob_2010.csv')
#2019 data
df_2019 = pd.read_csv('assets/yob2019.csv')

# Combine the Two Dataframes and Clean Up
I combined the 2010 and 2019 data into one frame so I could clean up and analyze it more easily.

In [51]:

#I combined the two dataframes into one and merged the Name column because there were, for example, more than one instance of the name Arya in 2010 and 2019.
#years_dataframes = [df_2010, df_2019]
#df_combined_years = pd.concat(years_dataframes, ignore_index=True)

df_combined_years = pd.merge(df_2010, df_2019, how='inner')


#change NaN values to zeroes
df_combined_years['2010 Name Count'].fillna(0, inplace = True)
df_combined_years['2019 Name Count'].fillna(0, inplace = True)
df_combined_years

           Name Gender  2010 Name Count  2019 Name Count
0      Isabella      F            22925            13360
1        Sophia      F            20648            13769
2          Emma      F            17354            17176
3           Ava      F            15436            14515
4         Emily      F            14278             8237
...         ...    ...              ...              ...
23293    Zuhair      M                5                9
23294   Zygmunt      M                5                5
23295     Zylar      M                5                9
23296     Zylin      M                5                8
23297     Zyran      M                5                5

[23298 rows x 4 columns]

# Analyze the Data
First, I used the .loc method to retrieve rows from the dataframe that contained specific _Game of Thrones_ character names.

In [50]:
#See how many times specific character names show up in the dataframe to compare occurences in year 2010 vs. 2019
df_combined_years.loc[(df_combined_years['Name']=='Cersei') |  
                        (df_combined_years['Name']=='Arya') | 
                        (df_combined_years['Name']=='Jon') | 
                        (df_combined_years['Name']=='Khaleesi') |
                        (df_combined_years['Name']=='Catelyn') |
                        (df_combined_years['Name']=='Bran') |
                        (df_combined_years['Name']=='Brienne') |
                        (df_combined_years['Name']=='Daenerys') |
                        (df_combined_years['Name']=='Jaime') |
                        (df_combined_years['Name']=='Joffrey') |
                        (df_combined_years['Name']=='Jorah') |
                        (df_combined_years['Name']=='Margaery') |
                        (df_combined_years['Name']=='Melisandre') |
                        (df_combined_years['Name']=='Robb') |
                        (df_combined_years['Name']=='Samwell') |
                        (df_combined_years['Name']=='Sansa') |
                        (df_combined_years['Name']=='Theon') |
                        (df_combined_years['Name']=='Tyrion')
                         ]

          Name Gender  2010 Name Count  2019 Name Count
940       Arya      F              273             3047
2122   Catelyn      F               93               15
2262     Jaime      F               85               48
6228   Brienne      F               20               33
13460    Jaime      M              814              518
13673      Jon      M              439              315
14823     Arya      M               88               49
20075   Tyrion      M               11               57
22704     Bran      M                5                8

In [314]:
#How do I put, for example, all female instances of "Arya" in one row?